Revit 2027 API
PromptForFamilyInstancePlacementOptions.SketchGalleryOptions Property
 The sketch option provided when promt to place a family instance.
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public SketchGalleryOptions SketchGalleryOptions { get; set; }
Public Property SketchGalleryOptions As SketchGalleryOptions
	Get
	Set
public:
property SketchGalleryOptions SketchGalleryOptions {
	SketchGalleryOptions get ();
	void set (SketchGalleryOptions value);
}
member SketchGalleryOptions : SketchGalleryOptions with get, set
Property Value
SketchGalleryOptions
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  When setting this property: A value passed for an enumeration argument is not a member of that enumeration
See Also
Reference
PromptForFamilyInstancePlacementOptions Class
Autodesk.Revit.UI Namespace